midhunjac/RF-handover/BLE_Beacon_Receiver/STM32_WPAN/App/app_ble.c
          case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
            {
              /* USER CODE BEGIN RADIO_ACTIVITY_EVENT */

              HW_TS_Start(BleApplicationContext.SwitchOffGPIO_timer_Id, (uint32_t)LED_ON_TIMEOUT);
              /* USER CODE END RADIO_ACTIVITY_EVENT */
            }
            break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
  #endif

          /* USER CODE BEGIN BLUE_EVT */

          /* USER CODE END BLUE_EVT */

          default:
            /* USER CODE BEGIN ecode_default */

            /* USER CODE END ecode_default */
            break;
        }
      }
      break;

    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
      {
        /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

        /* USER CODE END EVT_DISCONN_COMPLETE */
        if (cc->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
        {
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
          BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
          APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH SERVER \n\r");
          handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
          handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
          P2PC_APP_Notification(&handleNotification);
        }
      }
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
      {
        /* USER CODE BEGIN EVT_LE_META_EVENT */

        /* USER CODE END EVT_LE_META_EVENT */
        meta_evt = (evt_le_meta_event*) event_pckt->data;
        switch (meta_evt->subevent)
        {
          /* USER CODE BEGIN subevent */

          /* USER CODE END subevent */

          case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
            /* USER CODE BEGIN EVT_LE_CONN_COMPLETE */

            /* USER CODE END EVT_LE_CONN_COMPLETE */
            /**
             * The connection is done,
             */
            connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;

            /* CONNECTION WITH CLIENT */
            APP_DBG_MSG("\r\n\r**  CONNECTION COMPLETE EVENT WITH SERVER \n\r");
            handleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
            handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            P2PC_APP_Notification(&handleNotification);

            result = aci_gatt_disc_all_primary_services(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
            if (result == BLE_STATUS_SUCCESS)
            {
              APP_DBG_MSG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n\r");
              APP_DBG_MSG("* GATT :  Start Searching Primary Services \r\n\r");
            }
            else
            {
              APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
            }
            break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

          case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
            {
              uint8_t *adv_report_data;
              int8_t RSSI;
              /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT */

              /* USER CODE END EVT_LE_ADVERTISING_REPORT */
              le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;

              event_type = le_advertising_event->Advertising_Report[0].Event_Type;

              event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;




              /* WARNING: be careful when decoding advertising report as its raw format cannot be mapped on a C structure.
              The data and RSSI values could not be directly decoded from the RAM using the data and RSSI field from hci_le_advertising_report_event_rp0 structure.
              Instead they must be read by using offsets (please refer to BLE specification).
              RSSI = (int8_t)*(uint8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
              */
              adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
              RSSI = (int8_t)*(uint8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
              k = 0;

              /* search AD TYPE 0x09 (Complete Local Name) */
              /* search AD Type 0x02 (16 bits UUIDS) */
              if (event_type == ADV_NONCONN_IND)
              {
                /* ISOLATION OF BD ADDRESS AND LOCAL NAME */
   			   char MAC_Address[7] = "\0";
   			   char address[3];
   			   for(int i=5; i>=0; i--) {
   				   //printf("%x", le_advertising_event->Advertising_Report[0].Address[i]);
   				   sprintf(address, "%02X", le_advertising_event->Advertising_Report[0].Address[i]);
   				   strcat(MAC_Address,address);

   			   }
   			   //printf("\n\r");
   			   //printf("MAC Address %s\n\r", MAC_Address);

   			   if(!strcmp(MAC_Address, "0080E121BEFA")) {
   				   printf("Found\n\r");


					while(k < event_data_size)
					{
					  adlength = adv_report_data[k];
					  adtype = adv_report_data[k + 1];

					  //printf("Event type: %d     Event Data Size: %d     AD type: %d    RSSI:%d     \n\r", event_type, event_data_size, adtype, RSSI);
					  uint16_t Company_ID = (adv_report_data[k+2] << 8) | (adv_report_data[k+3]);
					  uint16_t Beacon_type = (adv_report_data[k+4] << 8) | (adv_report_data[k+5]);

					  switch (adtype)
					  {
						case AD_TYPE_FLAGS: /* now get flags */
						  /* USER CODE BEGIN AD_TYPE_FLAGS */

						  /* USER CODE END AD_TYPE_FLAGS */
						  break;

						case AD_TYPE_TX_POWER_LEVEL: /* Tx power level */
						  /* USER CODE BEGIN AD_TYPE_TX_POWER_LEVEL */

						  /* USER CODE END AD_TYPE_TX_POWER_LEVEL */
						  break;

						case AD_TYPE_MANUFACTURER_SPECIFIC_DATA: /* Manufacturer Specific */
						  /* USER CODE BEGIN AD_TYPE_MANUFACTURER_SPECIFIC_DATA */

